podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK21D5WS.h
#define ADC_CLMS_CLMS_MASK                       (0x3FU)                                             /*!< ADC0_CLMS: CLMS Mask                    */
#define ADC_CLMS_CLMS_SHIFT                      (0U)                                                /*!< ADC0_CLMS: CLMS Position                */
#define ADC_CLMS_CLMS(x)                         (((uint32_t)(((uint32_t)(x))<<ADC_CLMS_CLMS_SHIFT))&ADC_CLMS_CLMS_MASK) /*!< ADC0_CLMS                               */
/* ------- CLM4 Bit Fields                          ------ */
#define ADC_CLM4_CLM4_MASK                       (0x3FFU)                                            /*!< ADC0_CLM4: CLM4 Mask                    */
#define ADC_CLM4_CLM4_SHIFT                      (0U)                                                /*!< ADC0_CLM4: CLM4 Position                */
#define ADC_CLM4_CLM4(x)                         (((uint32_t)(((uint32_t)(x))<<ADC_CLM4_CLM4_SHIFT))&ADC_CLM4_CLM4_MASK) /*!< ADC0_CLM4                               */
/* ------- CLM3 Bit Fields                          ------ */
#define ADC_CLM3_CLM3_MASK                       (0x1FFU)                                            /*!< ADC0_CLM3: CLM3 Mask                    */
#define ADC_CLM3_CLM3_SHIFT                      (0U)                                                /*!< ADC0_CLM3: CLM3 Position                */
#define ADC_CLM3_CLM3(x)                         (((uint32_t)(((uint32_t)(x))<<ADC_CLM3_CLM3_SHIFT))&ADC_CLM3_CLM3_MASK) /*!< ADC0_CLM3                               */
/* ------- CLM2 Bit Fields                          ------ */
#define ADC_CLM2_CLM2_MASK                       (0xFFU)                                             /*!< ADC0_CLM2: CLM2 Mask                    */
#define ADC_CLM2_CLM2_SHIFT                      (0U)                                                /*!< ADC0_CLM2: CLM2 Position                */
#define ADC_CLM2_CLM2(x)                         (((uint32_t)(((uint32_t)(x))<<ADC_CLM2_CLM2_SHIFT))&ADC_CLM2_CLM2_MASK) /*!< ADC0_CLM2                               */
/* ------- CLM1 Bit Fields                          ------ */
#define ADC_CLM1_CLM1_MASK                       (0x7FU)                                             /*!< ADC0_CLM1: CLM1 Mask                    */
#define ADC_CLM1_CLM1_SHIFT                      (0U)                                                /*!< ADC0_CLM1: CLM1 Position                */
#define ADC_CLM1_CLM1(x)                         (((uint32_t)(((uint32_t)(x))<<ADC_CLM1_CLM1_SHIFT))&ADC_CLM1_CLM1_MASK) /*!< ADC0_CLM1                               */
/* ------- CLM0 Bit Fields                          ------ */
#define ADC_CLM0_CLM0_MASK                       (0x3FU)                                             /*!< ADC0_CLM0: CLM0 Mask                    */
#define ADC_CLM0_CLM0_SHIFT                      (0U)                                                /*!< ADC0_CLM0: CLM0 Position                */
#define ADC_CLM0_CLM0(x)                         (((uint32_t)(((uint32_t)(x))<<ADC_CLM0_CLM0_SHIFT))&ADC_CLM0_CLM0_MASK) /*!< ADC0_CLM0                               */
/**
 * @} */ /* End group ADC_Register_Masks_GROUP 
 */

/* ADC0 - Peripheral instance base addresses */
#define ADC0_BasePtr                   0x4003B000UL //!< Peripheral base address
#define ADC0                           ((ADC_Type *) ADC0_BasePtr) //!< Freescale base pointer
#define ADC0_BASE_PTR                  (ADC0) //!< Freescale style base pointer
/**
 * @} */ /* End group ADC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CAU_Peripheral_access_layer_GROUP CAU Peripheral Access Layer
* @brief C Struct for CAU
* @{
*/

/* ================================================================================ */
/* ================           CAU (file:CAU_0)                     ================ */
/* ================================================================================ */

/**
 * @brief Memory Mapped Cryptographic Acceleration Unit
 */
/**
* @addtogroup CAU_structs_GROUP CAU struct
* @brief Struct for CAU
* @{
*/
typedef struct {                                /*       CAU Structure                                                */
   __O  uint32_t  DIRECT[16];                   /**< 0000: Direct access register                                       */
        uint8_t   RESERVED_0[2048];            
   __O  uint32_t  LDR_CASR;                     /**< 0840: Status register - Load Register command                      */
   __O  uint32_t  LDR_CAA;                      /**< 0844: Accumulator register - Load Register command                 */
   __O  uint32_t  LDR_CA[9];                    /**< 0848: General Purpose Register  - Load Register command            */
        uint8_t   RESERVED_1[20];              
   __I  uint32_t  STR_CASR;                     /**< 0880: Status register  - Store Register command                    */
   __I  uint32_t  STR_CAA;                      /**< 0884: Accumulator register - Store Register command                */
   __I  uint32_t  STR_CA[9];                    /**< 0888: General Purpose Register  - Store Register command           */
        uint8_t   RESERVED_2[20];              
   __O  uint32_t  ADR_CASR;                     /**< 08C0: Status register  - Add Register command                      */
   __O  uint32_t  ADR_CAA;                      /**< 08C4: Accumulator register - Add to register command               */
   __O  uint32_t  ADR_CA[9];                    /**< 08C8: General Purpose Register  - Add to register command          */
        uint8_t   RESERVED_3[20];              
   __O  uint32_t  RADR_CASR;                    /**< 0900: Status register  - Reverse and Add to Register command       */
   __O  uint32_t  RADR_CAA;                     /**< 0904: Accumulator register - Reverse and Add to Register command   */
   __O  uint32_t  RADR_CA[9];                   /**< 0908: General Purpose Register  - Reverse and Add to Register command */
        uint8_t   RESERVED_4[84];              
   __O  uint32_t  XOR_CASR;                     /**< 0980: Status register  - Exclusive Or command                      */
   __O  uint32_t  XOR_CAA;                      /**< 0984: Accumulator register - Exclusive Or command                  */
   __O  uint32_t  XOR_CA[9];                    /**< 0988: General Purpose Register  - Exclusive Or command             */
        uint8_t   RESERVED_5[20];              
   __O  uint32_t  ROTL_CASR;                    /**< 09C0: Status register  - Rotate Left command                       */
   __O  uint32_t  ROTL_CAA;                     /**< 09C4: Accumulator register - Rotate Left command                   */
   __O  uint32_t  ROTL_CA[9];                   /**< 09C8: General Purpose Register  - Rotate Left command              */
        uint8_t   RESERVED_6[276];             
   __O  uint32_t  AESC_CASR;                    /**< 0B00: Status register  - AES Column Operation command              */
   __O  uint32_t  AESC_CAA;                     /**< 0B04: Accumulator register - AES Column Operation command          */
   __O  uint32_t  AESC_CA[9];                   /**< 0B08: General Purpose Register  - AES Column Operation command     */
        uint8_t   RESERVED_7[20];              
   __O  uint32_t  AESIC_CASR;                   /**< 0B40: Status register  - AES Inverse Column Operation command      */
   __O  uint32_t  AESIC_CAA;                    /**< 0B44: Accumulator register - AES Inverse Column Operation command  */
   __O  uint32_t  AESIC_CA[9];                  /**< 0B48: General Purpose Register  - AES Inverse Column Operation command */
} CAU_Type;

/**
 * @} */ /* End group CAU_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'CAU' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup CAU_Register_Masks_GROUP CAU Register Masks
* @brief Register Masks for CAU
* @{
*/
/* ------- DIRECT Bit Fields                        ------ */
/* ------- LDR_CASR Bit Fields                      ------ */
#define CAU_LDR_CASR_IC_MASK                     (0x1U)                                              /*!< CAU_LDR_CASR: IC Mask                   */
#define CAU_LDR_CASR_IC_SHIFT                    (0U)                                                /*!< CAU_LDR_CASR: IC Position               */
#define CAU_LDR_CASR_IC(x)                       (((uint32_t)(((uint32_t)(x))<<CAU_LDR_CASR_IC_SHIFT))&CAU_LDR_CASR_IC_MASK) /*!< CAU_LDR_CASR                            */
#define CAU_LDR_CASR_DPE_MASK                    (0x2U)                                              /*!< CAU_LDR_CASR: DPE Mask                  */
#define CAU_LDR_CASR_DPE_SHIFT                   (1U)                                                /*!< CAU_LDR_CASR: DPE Position              */
#define CAU_LDR_CASR_DPE(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_LDR_CASR_DPE_SHIFT))&CAU_LDR_CASR_DPE_MASK) /*!< CAU_LDR_CASR                            */
#define CAU_LDR_CASR_VER_MASK                    (0xF0000000U)                                       /*!< CAU_LDR_CASR: VER Mask                  */
#define CAU_LDR_CASR_VER_SHIFT                   (28U)                                               /*!< CAU_LDR_CASR: VER Position              */
#define CAU_LDR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_LDR_CASR_VER_SHIFT))&CAU_LDR_CASR_VER_MASK) /*!< CAU_LDR_CASR                            */
/* ------- LDR_CAA Bit Fields                       ------ */
/* ------- LDR_CA Bit Fields                        ------ */
/* ------- STR_CASR Bit Fields                      ------ */
#define CAU_STR_CASR_IC_MASK                     (0x1U)                                              /*!< CAU_STR_CASR: IC Mask                   */
#define CAU_STR_CASR_IC_SHIFT                    (0U)                                                /*!< CAU_STR_CASR: IC Position               */
#define CAU_STR_CASR_IC(x)                       (((uint32_t)(((uint32_t)(x))<<CAU_STR_CASR_IC_SHIFT))&CAU_STR_CASR_IC_MASK) /*!< CAU_STR_CASR                            */
#define CAU_STR_CASR_DPE_MASK                    (0x2U)                                              /*!< CAU_STR_CASR: DPE Mask                  */
#define CAU_STR_CASR_DPE_SHIFT                   (1U)                                                /*!< CAU_STR_CASR: DPE Position              */
#define CAU_STR_CASR_DPE(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_STR_CASR_DPE_SHIFT))&CAU_STR_CASR_DPE_MASK) /*!< CAU_STR_CASR                            */
#define CAU_STR_CASR_VER_MASK                    (0xF0000000U)                                       /*!< CAU_STR_CASR: VER Mask                  */
#define CAU_STR_CASR_VER_SHIFT                   (28U)                                               /*!< CAU_STR_CASR: VER Position              */
#define CAU_STR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_STR_CASR_VER_SHIFT))&CAU_STR_CASR_VER_MASK) /*!< CAU_STR_CASR                            */
/* ------- STR_CAA Bit Fields                       ------ */
/* ------- STR_CA Bit Fields                        ------ */
/* ------- ADR_CASR Bit Fields                      ------ */
#define CAU_ADR_CASR_IC_MASK                     (0x1U)                                              /*!< CAU_ADR_CASR: IC Mask                   */
#define CAU_ADR_CASR_IC_SHIFT                    (0U)                                                /*!< CAU_ADR_CASR: IC Position               */
#define CAU_ADR_CASR_IC(x)                       (((uint32_t)(((uint32_t)(x))<<CAU_ADR_CASR_IC_SHIFT))&CAU_ADR_CASR_IC_MASK) /*!< CAU_ADR_CASR                            */
#define CAU_ADR_CASR_DPE_MASK                    (0x2U)                                              /*!< CAU_ADR_CASR: DPE Mask                  */
#define CAU_ADR_CASR_DPE_SHIFT                   (1U)                                                /*!< CAU_ADR_CASR: DPE Position              */
#define CAU_ADR_CASR_DPE(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_ADR_CASR_DPE_SHIFT))&CAU_ADR_CASR_DPE_MASK) /*!< CAU_ADR_CASR                            */
#define CAU_ADR_CASR_VER_MASK                    (0xF0000000U)                                       /*!< CAU_ADR_CASR: VER Mask                  */
#define CAU_ADR_CASR_VER_SHIFT                   (28U)                                               /*!< CAU_ADR_CASR: VER Position              */
#define CAU_ADR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_ADR_CASR_VER_SHIFT))&CAU_ADR_CASR_VER_MASK) /*!< CAU_ADR_CASR                            */
/* ------- ADR_CAA Bit Fields                       ------ */
/* ------- ADR_CA Bit Fields                        ------ */
/* ------- RADR_CASR Bit Fields                     ------ */
#define CAU_RADR_CASR_IC_MASK                    (0x1U)                                              /*!< CAU_RADR_CASR: IC Mask                  */
#define CAU_RADR_CASR_IC_SHIFT                   (0U)                                                /*!< CAU_RADR_CASR: IC Position              */
#define CAU_RADR_CASR_IC(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_RADR_CASR_IC_SHIFT))&CAU_RADR_CASR_IC_MASK) /*!< CAU_RADR_CASR                           */
#define CAU_RADR_CASR_DPE_MASK                   (0x2U)                                              /*!< CAU_RADR_CASR: DPE Mask                 */
#define CAU_RADR_CASR_DPE_SHIFT                  (1U)                                                /*!< CAU_RADR_CASR: DPE Position             */
#define CAU_RADR_CASR_DPE(x)                     (((uint32_t)(((uint32_t)(x))<<CAU_RADR_CASR_DPE_SHIFT))&CAU_RADR_CASR_DPE_MASK) /*!< CAU_RADR_CASR                           */
#define CAU_RADR_CASR_VER_MASK                   (0xF0000000U)                                       /*!< CAU_RADR_CASR: VER Mask                 */
#define CAU_RADR_CASR_VER_SHIFT                  (28U)                                               /*!< CAU_RADR_CASR: VER Position             */
#define CAU_RADR_CASR_VER(x)                     (((uint32_t)(((uint32_t)(x))<<CAU_RADR_CASR_VER_SHIFT))&CAU_RADR_CASR_VER_MASK) /*!< CAU_RADR_CASR                           */
/* ------- RADR_CAA Bit Fields                      ------ */
/* ------- RADR_CA Bit Fields                       ------ */
/* ------- XOR_CASR Bit Fields                      ------ */
#define CAU_XOR_CASR_IC_MASK                     (0x1U)                                              /*!< CAU_XOR_CASR: IC Mask                   */
#define CAU_XOR_CASR_IC_SHIFT                    (0U)                                                /*!< CAU_XOR_CASR: IC Position               */
#define CAU_XOR_CASR_IC(x)                       (((uint32_t)(((uint32_t)(x))<<CAU_XOR_CASR_IC_SHIFT))&CAU_XOR_CASR_IC_MASK) /*!< CAU_XOR_CASR                            */
#define CAU_XOR_CASR_DPE_MASK                    (0x2U)                                              /*!< CAU_XOR_CASR: DPE Mask                  */
#define CAU_XOR_CASR_DPE_SHIFT                   (1U)                                                /*!< CAU_XOR_CASR: DPE Position              */
#define CAU_XOR_CASR_DPE(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_XOR_CASR_DPE_SHIFT))&CAU_XOR_CASR_DPE_MASK) /*!< CAU_XOR_CASR                            */
#define CAU_XOR_CASR_VER_MASK                    (0xF0000000U)                                       /*!< CAU_XOR_CASR: VER Mask                  */
#define CAU_XOR_CASR_VER_SHIFT                   (28U)                                               /*!< CAU_XOR_CASR: VER Position              */
#define CAU_XOR_CASR_VER(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_XOR_CASR_VER_SHIFT))&CAU_XOR_CASR_VER_MASK) /*!< CAU_XOR_CASR                            */
/* ------- XOR_CAA Bit Fields                       ------ */
/* ------- XOR_CA Bit Fields                        ------ */
/* ------- ROTL_CASR Bit Fields                     ------ */
#define CAU_ROTL_CASR_IC_MASK                    (0x1U)                                              /*!< CAU_ROTL_CASR: IC Mask                  */
#define CAU_ROTL_CASR_IC_SHIFT                   (0U)                                                /*!< CAU_ROTL_CASR: IC Position              */
#define CAU_ROTL_CASR_IC(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_ROTL_CASR_IC_SHIFT))&CAU_ROTL_CASR_IC_MASK) /*!< CAU_ROTL_CASR                           */
#define CAU_ROTL_CASR_DPE_MASK                   (0x2U)                                              /*!< CAU_ROTL_CASR: DPE Mask                 */
#define CAU_ROTL_CASR_DPE_SHIFT                  (1U)                                                /*!< CAU_ROTL_CASR: DPE Position             */
#define CAU_ROTL_CASR_DPE(x)                     (((uint32_t)(((uint32_t)(x))<<CAU_ROTL_CASR_DPE_SHIFT))&CAU_ROTL_CASR_DPE_MASK) /*!< CAU_ROTL_CASR                           */
#define CAU_ROTL_CASR_VER_MASK                   (0xF0000000U)                                       /*!< CAU_ROTL_CASR: VER Mask                 */
#define CAU_ROTL_CASR_VER_SHIFT                  (28U)                                               /*!< CAU_ROTL_CASR: VER Position             */
#define CAU_ROTL_CASR_VER(x)                     (((uint32_t)(((uint32_t)(x))<<CAU_ROTL_CASR_VER_SHIFT))&CAU_ROTL_CASR_VER_MASK) /*!< CAU_ROTL_CASR                           */
/* ------- ROTL_CAA Bit Fields                      ------ */
/* ------- ROTL_CA Bit Fields                       ------ */
/* ------- AESC_CASR Bit Fields                     ------ */
#define CAU_AESC_CASR_IC_MASK                    (0x1U)                                              /*!< CAU_AESC_CASR: IC Mask                  */
#define CAU_AESC_CASR_IC_SHIFT                   (0U)                                                /*!< CAU_AESC_CASR: IC Position              */
#define CAU_AESC_CASR_IC(x)                      (((uint32_t)(((uint32_t)(x))<<CAU_AESC_CASR_IC_SHIFT))&CAU_AESC_CASR_IC_MASK) /*!< CAU_AESC_CASR                           */
#define CAU_AESC_CASR_DPE_MASK                   (0x2U)                                              /*!< CAU_AESC_CASR: DPE Mask                 */
#define CAU_AESC_CASR_DPE_SHIFT                  (1U)                                                /*!< CAU_AESC_CASR: DPE Position             */
#define CAU_AESC_CASR_DPE(x)                     (((uint32_t)(((uint32_t)(x))<<CAU_AESC_CASR_DPE_SHIFT))&CAU_AESC_CASR_DPE_MASK) /*!< CAU_AESC_CASR                           */
#define CAU_AESC_CASR_VER_MASK                   (0xF0000000U)                                       /*!< CAU_AESC_CASR: VER Mask                 */
#define CAU_AESC_CASR_VER_SHIFT                  (28U)                                               /*!< CAU_AESC_CASR: VER Position             */
#define CAU_AESC_CASR_VER(x)                     (((uint32_t)(((uint32_t)(x))<<CAU_AESC_CASR_VER_SHIFT))&CAU_AESC_CASR_VER_MASK) /*!< CAU_AESC_CASR                           */
/* ------- AESC_CAA Bit Fields                      ------ */
/* ------- AESC_CA Bit Fields                       ------ */
/* ------- AESIC_CASR Bit Fields                    ------ */
#define CAU_AESIC_CASR_IC_MASK                   (0x1U)                                              /*!< CAU_AESIC_CASR: IC Mask                 */
#define CAU_AESIC_CASR_IC_SHIFT                  (0U)                                                /*!< CAU_AESIC_CASR: IC Position             */
#define CAU_AESIC_CASR_IC(x)                     (((uint32_t)(((uint32_t)(x))<<CAU_AESIC_CASR_IC_SHIFT))&CAU_AESIC_CASR_IC_MASK) /*!< CAU_AESIC_CASR                          */
#define CAU_AESIC_CASR_DPE_MASK                  (0x2U)                                              /*!< CAU_AESIC_CASR: DPE Mask                */
#define CAU_AESIC_CASR_DPE_SHIFT                 (1U)                                                /*!< CAU_AESIC_CASR: DPE Position            */
#define CAU_AESIC_CASR_DPE(x)                    (((uint32_t)(((uint32_t)(x))<<CAU_AESIC_CASR_DPE_SHIFT))&CAU_AESIC_CASR_DPE_MASK) /*!< CAU_AESIC_CASR                          */
#define CAU_AESIC_CASR_VER_MASK                  (0xF0000000U)                                       /*!< CAU_AESIC_CASR: VER Mask                */
#define CAU_AESIC_CASR_VER_SHIFT                 (28U)                                               /*!< CAU_AESIC_CASR: VER Position            */
#define CAU_AESIC_CASR_VER(x)                    (((uint32_t)(((uint32_t)(x))<<CAU_AESIC_CASR_VER_SHIFT))&CAU_AESIC_CASR_VER_MASK) /*!< CAU_AESIC_CASR                          */
/* ------- AESIC_CAA Bit Fields                     ------ */
/* ------- AESIC_CA Bit Fields                      ------ */
/**
 * @} */ /* End group CAU_Register_Masks_GROUP 
 */

