podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK21D5WS.h
/**
* @addtogroup DRY_Register_Masks_GROUP DRY Register Masks
* @brief Register Masks for DRY
* @{
*/
/* ------- SKVR Bit Fields                          ------ */
#define DRY_SKVR_SKV_MASK                        (0xFFU)                                             /*!< DRY_SKVR: SKV Mask                      */
#define DRY_SKVR_SKV_SHIFT                       (0U)                                                /*!< DRY_SKVR: SKV Position                  */
#define DRY_SKVR_SKV(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_SKVR_SKV_SHIFT))&DRY_SKVR_SKV_MASK) /*!< DRY_SKVR                                */
/* ------- SKWLR Bit Fields                         ------ */
#define DRY_SKWLR_SKWL_MASK                      (0xFFU)                                             /*!< DRY_SKWLR: SKWL Mask                    */
#define DRY_SKWLR_SKWL_SHIFT                     (0U)                                                /*!< DRY_SKWLR: SKWL Position                */
#define DRY_SKWLR_SKWL(x)                        (((uint32_t)(((uint32_t)(x))<<DRY_SKWLR_SKWL_SHIFT))&DRY_SKWLR_SKWL_MASK) /*!< DRY_SKWLR                               */
/* ------- SKRLR Bit Fields                         ------ */
#define DRY_SKRLR_SKRL_MASK                      (0xFFU)                                             /*!< DRY_SKRLR: SKRL Mask                    */
#define DRY_SKRLR_SKRL_SHIFT                     (0U)                                                /*!< DRY_SKRLR: SKRL Position                */
#define DRY_SKRLR_SKRL(x)                        (((uint32_t)(((uint32_t)(x))<<DRY_SKRLR_SKRL_SHIFT))&DRY_SKRLR_SKRL_MASK) /*!< DRY_SKRLR                               */
/* ------- CR Bit Fields                            ------ */
#define DRY_CR_SWR_MASK                          (0x1U)                                              /*!< DRY_CR: SWR Mask                        */
#define DRY_CR_SWR_SHIFT                         (0U)                                                /*!< DRY_CR: SWR Position                    */
#define DRY_CR_SWR(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_CR_SWR_SHIFT))&DRY_CR_SWR_MASK) /*!< DRY_CR                                  */
#define DRY_CR_DEN_MASK                          (0x2U)                                              /*!< DRY_CR: DEN Mask                        */
#define DRY_CR_DEN_SHIFT                         (1U)                                                /*!< DRY_CR: DEN Position                    */
#define DRY_CR_DEN(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_CR_DEN_SHIFT))&DRY_CR_DEN_MASK) /*!< DRY_CR                                  */
#define DRY_CR_TFSR_MASK                         (0x4U)                                              /*!< DRY_CR: TFSR Mask                       */
#define DRY_CR_TFSR_SHIFT                        (2U)                                                /*!< DRY_CR: TFSR Position                   */
#define DRY_CR_TFSR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_CR_TFSR_SHIFT))&DRY_CR_TFSR_MASK) /*!< DRY_CR                                  */
#define DRY_CR_UM_MASK                           (0x8U)                                              /*!< DRY_CR: UM Mask                         */
#define DRY_CR_UM_SHIFT                          (3U)                                                /*!< DRY_CR: UM Position                     */
#define DRY_CR_UM(x)                             (((uint32_t)(((uint32_t)(x))<<DRY_CR_UM_SHIFT))&DRY_CR_UM_MASK) /*!< DRY_CR                                  */
#define DRY_CR_THYS_MASK                         (0x100U)                                            /*!< DRY_CR: THYS Mask                       */
#define DRY_CR_THYS_SHIFT                        (8U)                                                /*!< DRY_CR: THYS Position                   */
#define DRY_CR_THYS(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_CR_THYS_SHIFT))&DRY_CR_THYS_MASK) /*!< DRY_CR                                  */
#define DRY_CR_TPFE_MASK                         (0x200U)                                            /*!< DRY_CR: TPFE Mask                       */
#define DRY_CR_TPFE_SHIFT                        (9U)                                                /*!< DRY_CR: TPFE Position                   */
#define DRY_CR_TPFE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_CR_TPFE_SHIFT))&DRY_CR_TPFE_MASK) /*!< DRY_CR                                  */
#define DRY_CR_TDSE_MASK                         (0x400U)                                            /*!< DRY_CR: TDSE Mask                       */
#define DRY_CR_TDSE_SHIFT                        (10U)                                               /*!< DRY_CR: TDSE Position                   */
#define DRY_CR_TDSE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_CR_TDSE_SHIFT))&DRY_CR_TDSE_MASK) /*!< DRY_CR                                  */
#define DRY_CR_TSRE_MASK                         (0x800U)                                            /*!< DRY_CR: TSRE Mask                       */
#define DRY_CR_TSRE_SHIFT                        (11U)                                               /*!< DRY_CR: TSRE Position                   */
#define DRY_CR_TSRE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_CR_TSRE_SHIFT))&DRY_CR_TSRE_MASK) /*!< DRY_CR                                  */
#define DRY_CR_DPR_MASK                          (0xFFFE0000U)                                       /*!< DRY_CR: DPR Mask                        */
#define DRY_CR_DPR_SHIFT                         (17U)                                               /*!< DRY_CR: DPR Position                    */
#define DRY_CR_DPR(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_CR_DPR_SHIFT))&DRY_CR_DPR_MASK) /*!< DRY_CR                                  */
/* ------- SR Bit Fields                            ------ */
#define DRY_SR_DTF_MASK                          (0x1U)                                              /*!< DRY_SR: DTF Mask                        */
#define DRY_SR_DTF_SHIFT                         (0U)                                                /*!< DRY_SR: DTF Position                    */
#define DRY_SR_DTF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_DTF_SHIFT))&DRY_SR_DTF_MASK) /*!< DRY_SR                                  */
#define DRY_SR_TAF_MASK                          (0x2U)                                              /*!< DRY_SR: TAF Mask                        */
#define DRY_SR_TAF_SHIFT                         (1U)                                                /*!< DRY_SR: TAF Position                    */
#define DRY_SR_TAF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_TAF_SHIFT))&DRY_SR_TAF_MASK) /*!< DRY_SR                                  */
#define DRY_SR_TOF_MASK                          (0x4U)                                              /*!< DRY_SR: TOF Mask                        */
#define DRY_SR_TOF_SHIFT                         (2U)                                                /*!< DRY_SR: TOF Position                    */
#define DRY_SR_TOF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_TOF_SHIFT))&DRY_SR_TOF_MASK) /*!< DRY_SR                                  */
#define DRY_SR_MOF_MASK                          (0x8U)                                              /*!< DRY_SR: MOF Mask                        */
#define DRY_SR_MOF_SHIFT                         (3U)                                                /*!< DRY_SR: MOF Position                    */
#define DRY_SR_MOF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_MOF_SHIFT))&DRY_SR_MOF_MASK) /*!< DRY_SR                                  */
#define DRY_SR_VTF_MASK                          (0x10U)                                             /*!< DRY_SR: VTF Mask                        */
#define DRY_SR_VTF_SHIFT                         (4U)                                                /*!< DRY_SR: VTF Position                    */
#define DRY_SR_VTF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_VTF_SHIFT))&DRY_SR_VTF_MASK) /*!< DRY_SR                                  */
#define DRY_SR_CTF_MASK                          (0x20U)                                             /*!< DRY_SR: CTF Mask                        */
#define DRY_SR_CTF_SHIFT                         (5U)                                                /*!< DRY_SR: CTF Position                    */
#define DRY_SR_CTF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_CTF_SHIFT))&DRY_SR_CTF_MASK) /*!< DRY_SR                                  */
#define DRY_SR_TTF_MASK                          (0x40U)                                             /*!< DRY_SR: TTF Mask                        */
#define DRY_SR_TTF_SHIFT                         (6U)                                                /*!< DRY_SR: TTF Position                    */
#define DRY_SR_TTF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_TTF_SHIFT))&DRY_SR_TTF_MASK) /*!< DRY_SR                                  */
#define DRY_SR_STF_MASK                          (0x80U)                                             /*!< DRY_SR: STF Mask                        */
#define DRY_SR_STF_SHIFT                         (7U)                                                /*!< DRY_SR: STF Position                    */
#define DRY_SR_STF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_STF_SHIFT))&DRY_SR_STF_MASK) /*!< DRY_SR                                  */
#define DRY_SR_FSF_MASK                          (0x100U)                                            /*!< DRY_SR: FSF Mask                        */
#define DRY_SR_FSF_SHIFT                         (8U)                                                /*!< DRY_SR: FSF Position                    */
#define DRY_SR_FSF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_FSF_SHIFT))&DRY_SR_FSF_MASK) /*!< DRY_SR                                  */
#define DRY_SR_TMF_MASK                          (0x200U)                                            /*!< DRY_SR: TMF Mask                        */
#define DRY_SR_TMF_SHIFT                         (9U)                                                /*!< DRY_SR: TMF Position                    */
#define DRY_SR_TMF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_TMF_SHIFT))&DRY_SR_TMF_MASK) /*!< DRY_SR                                  */
#define DRY_SR_TPF_MASK                          (0xFF0000U)                                         /*!< DRY_SR: TPF Mask                        */
#define DRY_SR_TPF_SHIFT                         (16U)                                               /*!< DRY_SR: TPF Position                    */
#define DRY_SR_TPF(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SR_TPF_SHIFT))&DRY_SR_TPF_MASK) /*!< DRY_SR                                  */
/* ------- LR Bit Fields                            ------ */
#define DRY_LR_KVL_MASK                          (0x2U)                                              /*!< DRY_LR: KVL Mask                        */
#define DRY_LR_KVL_SHIFT                         (1U)                                                /*!< DRY_LR: KVL Position                    */
#define DRY_LR_KVL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_KVL_SHIFT))&DRY_LR_KVL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_KWL_MASK                          (0x4U)                                              /*!< DRY_LR: KWL Mask                        */
#define DRY_LR_KWL_SHIFT                         (2U)                                                /*!< DRY_LR: KWL Position                    */
#define DRY_LR_KWL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_KWL_SHIFT))&DRY_LR_KWL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_KRL_MASK                          (0x8U)                                              /*!< DRY_LR: KRL Mask                        */
#define DRY_LR_KRL_SHIFT                         (3U)                                                /*!< DRY_LR: KRL Position                    */
#define DRY_LR_KRL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_KRL_SHIFT))&DRY_LR_KRL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_CRL_MASK                          (0x10U)                                             /*!< DRY_LR: CRL Mask                        */
#define DRY_LR_CRL_SHIFT                         (4U)                                                /*!< DRY_LR: CRL Position                    */
#define DRY_LR_CRL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_CRL_SHIFT))&DRY_LR_CRL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_SRL_MASK                          (0x20U)                                             /*!< DRY_LR: SRL Mask                        */
#define DRY_LR_SRL_SHIFT                         (5U)                                                /*!< DRY_LR: SRL Position                    */
#define DRY_LR_SRL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_SRL_SHIFT))&DRY_LR_SRL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_LRL_MASK                          (0x40U)                                             /*!< DRY_LR: LRL Mask                        */
#define DRY_LR_LRL_SHIFT                         (6U)                                                /*!< DRY_LR: LRL Position                    */
#define DRY_LR_LRL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_LRL_SHIFT))&DRY_LR_LRL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_IEL_MASK                          (0x80U)                                             /*!< DRY_LR: IEL Mask                        */
#define DRY_LR_IEL_SHIFT                         (7U)                                                /*!< DRY_LR: IEL Position                    */
#define DRY_LR_IEL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_IEL_SHIFT))&DRY_LR_IEL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_TSL_MASK                          (0x100U)                                            /*!< DRY_LR: TSL Mask                        */
#define DRY_LR_TSL_SHIFT                         (8U)                                                /*!< DRY_LR: TSL Position                    */
#define DRY_LR_TSL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_TSL_SHIFT))&DRY_LR_TSL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_TEL_MASK                          (0x200U)                                            /*!< DRY_LR: TEL Mask                        */
#define DRY_LR_TEL_SHIFT                         (9U)                                                /*!< DRY_LR: TEL Position                    */
#define DRY_LR_TEL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_TEL_SHIFT))&DRY_LR_TEL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_PDL_MASK                          (0x400U)                                            /*!< DRY_LR: PDL Mask                        */
#define DRY_LR_PDL_SHIFT                         (10U)                                               /*!< DRY_LR: PDL Position                    */
#define DRY_LR_PDL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_PDL_SHIFT))&DRY_LR_PDL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_PPL_MASK                          (0x800U)                                            /*!< DRY_LR: PPL Mask                        */
#define DRY_LR_PPL_SHIFT                         (11U)                                               /*!< DRY_LR: PPL Position                    */
#define DRY_LR_PPL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_PPL_SHIFT))&DRY_LR_PPL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_ATL_MASK                          (0x3000U)                                           /*!< DRY_LR: ATL Mask                        */
#define DRY_LR_ATL_SHIFT                         (12U)                                               /*!< DRY_LR: ATL Position                    */
#define DRY_LR_ATL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_ATL_SHIFT))&DRY_LR_ATL_MASK) /*!< DRY_LR                                  */
#define DRY_LR_GFL_MASK                          (0xFF0000U)                                         /*!< DRY_LR: GFL Mask                        */
#define DRY_LR_GFL_SHIFT                         (16U)                                               /*!< DRY_LR: GFL Position                    */
#define DRY_LR_GFL(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_LR_GFL_SHIFT))&DRY_LR_GFL_MASK) /*!< DRY_LR                                  */
/* ------- IER Bit Fields                           ------ */
#define DRY_IER_DTIE_MASK                        (0x1U)                                              /*!< DRY_IER: DTIE Mask                      */
#define DRY_IER_DTIE_SHIFT                       (0U)                                                /*!< DRY_IER: DTIE Position                  */
#define DRY_IER_DTIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_DTIE_SHIFT))&DRY_IER_DTIE_MASK) /*!< DRY_IER                                 */
#define DRY_IER_TOIE_MASK                        (0x4U)                                              /*!< DRY_IER: TOIE Mask                      */
#define DRY_IER_TOIE_SHIFT                       (2U)                                                /*!< DRY_IER: TOIE Position                  */
#define DRY_IER_TOIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_TOIE_SHIFT))&DRY_IER_TOIE_MASK) /*!< DRY_IER                                 */
#define DRY_IER_MOIE_MASK                        (0x8U)                                              /*!< DRY_IER: MOIE Mask                      */
#define DRY_IER_MOIE_SHIFT                       (3U)                                                /*!< DRY_IER: MOIE Position                  */
#define DRY_IER_MOIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_MOIE_SHIFT))&DRY_IER_MOIE_MASK) /*!< DRY_IER                                 */
#define DRY_IER_VTIE_MASK                        (0x10U)                                             /*!< DRY_IER: VTIE Mask                      */
#define DRY_IER_VTIE_SHIFT                       (4U)                                                /*!< DRY_IER: VTIE Position                  */
#define DRY_IER_VTIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_VTIE_SHIFT))&DRY_IER_VTIE_MASK) /*!< DRY_IER                                 */
#define DRY_IER_CTIE_MASK                        (0x20U)                                             /*!< DRY_IER: CTIE Mask                      */
#define DRY_IER_CTIE_SHIFT                       (5U)                                                /*!< DRY_IER: CTIE Position                  */
#define DRY_IER_CTIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_CTIE_SHIFT))&DRY_IER_CTIE_MASK) /*!< DRY_IER                                 */
#define DRY_IER_TTIE_MASK                        (0x40U)                                             /*!< DRY_IER: TTIE Mask                      */
#define DRY_IER_TTIE_SHIFT                       (6U)                                                /*!< DRY_IER: TTIE Position                  */
#define DRY_IER_TTIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_TTIE_SHIFT))&DRY_IER_TTIE_MASK) /*!< DRY_IER                                 */
#define DRY_IER_STIE_MASK                        (0x80U)                                             /*!< DRY_IER: STIE Mask                      */
#define DRY_IER_STIE_SHIFT                       (7U)                                                /*!< DRY_IER: STIE Position                  */
#define DRY_IER_STIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_STIE_SHIFT))&DRY_IER_STIE_MASK) /*!< DRY_IER                                 */
#define DRY_IER_FSIE_MASK                        (0x100U)                                            /*!< DRY_IER: FSIE Mask                      */
#define DRY_IER_FSIE_SHIFT                       (8U)                                                /*!< DRY_IER: FSIE Position                  */
#define DRY_IER_FSIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_FSIE_SHIFT))&DRY_IER_FSIE_MASK) /*!< DRY_IER                                 */
#define DRY_IER_TMIE_MASK                        (0x200U)                                            /*!< DRY_IER: TMIE Mask                      */
#define DRY_IER_TMIE_SHIFT                       (9U)                                                /*!< DRY_IER: TMIE Position                  */
#define DRY_IER_TMIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_TMIE_SHIFT))&DRY_IER_TMIE_MASK) /*!< DRY_IER                                 */
#define DRY_IER_TPIE_MASK                        (0xFF0000U)                                         /*!< DRY_IER: TPIE Mask                      */
#define DRY_IER_TPIE_SHIFT                       (16U)                                               /*!< DRY_IER: TPIE Position                  */
#define DRY_IER_TPIE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_IER_TPIE_SHIFT))&DRY_IER_TPIE_MASK) /*!< DRY_IER                                 */
/* ------- TSR Bit Fields                           ------ */
#define DRY_TSR_TTS_MASK                         (0xFFFFFFFFU)                                       /*!< DRY_TSR: TTS Mask                       */
#define DRY_TSR_TTS_SHIFT                        (0U)                                                /*!< DRY_TSR: TTS Position                   */
#define DRY_TSR_TTS(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TSR_TTS_SHIFT))&DRY_TSR_TTS_MASK) /*!< DRY_TSR                                 */
/* ------- TER Bit Fields                           ------ */
#define DRY_TER_TOE_MASK                         (0x4U)                                              /*!< DRY_TER: TOE Mask                       */
#define DRY_TER_TOE_SHIFT                        (2U)                                                /*!< DRY_TER: TOE Position                   */
#define DRY_TER_TOE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_TOE_SHIFT))&DRY_TER_TOE_MASK) /*!< DRY_TER                                 */
#define DRY_TER_MOE_MASK                         (0x8U)                                              /*!< DRY_TER: MOE Mask                       */
#define DRY_TER_MOE_SHIFT                        (3U)                                                /*!< DRY_TER: MOE Position                   */
#define DRY_TER_MOE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_MOE_SHIFT))&DRY_TER_MOE_MASK) /*!< DRY_TER                                 */
#define DRY_TER_VTE_MASK                         (0x10U)                                             /*!< DRY_TER: VTE Mask                       */
#define DRY_TER_VTE_SHIFT                        (4U)                                                /*!< DRY_TER: VTE Position                   */
#define DRY_TER_VTE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_VTE_SHIFT))&DRY_TER_VTE_MASK) /*!< DRY_TER                                 */
#define DRY_TER_CTE_MASK                         (0x20U)                                             /*!< DRY_TER: CTE Mask                       */
