podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK21D5WS.h
#define DRY_TER_CTE_SHIFT                        (5U)                                                /*!< DRY_TER: CTE Position                   */
#define DRY_TER_CTE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_CTE_SHIFT))&DRY_TER_CTE_MASK) /*!< DRY_TER                                 */
#define DRY_TER_TTE_MASK                         (0x40U)                                             /*!< DRY_TER: TTE Mask                       */
#define DRY_TER_TTE_SHIFT                        (6U)                                                /*!< DRY_TER: TTE Position                   */
#define DRY_TER_TTE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_TTE_SHIFT))&DRY_TER_TTE_MASK) /*!< DRY_TER                                 */
#define DRY_TER_STE_MASK                         (0x80U)                                             /*!< DRY_TER: STE Mask                       */
#define DRY_TER_STE_SHIFT                        (7U)                                                /*!< DRY_TER: STE Position                   */
#define DRY_TER_STE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_STE_SHIFT))&DRY_TER_STE_MASK) /*!< DRY_TER                                 */
#define DRY_TER_FSE_MASK                         (0x100U)                                            /*!< DRY_TER: FSE Mask                       */
#define DRY_TER_FSE_SHIFT                        (8U)                                                /*!< DRY_TER: FSE Position                   */
#define DRY_TER_FSE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_FSE_SHIFT))&DRY_TER_FSE_MASK) /*!< DRY_TER                                 */
#define DRY_TER_TME_MASK                         (0x200U)                                            /*!< DRY_TER: TME Mask                       */
#define DRY_TER_TME_SHIFT                        (9U)                                                /*!< DRY_TER: TME Position                   */
#define DRY_TER_TME(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_TME_SHIFT))&DRY_TER_TME_MASK) /*!< DRY_TER                                 */
#define DRY_TER_TPE_MASK                         (0xFF0000U)                                         /*!< DRY_TER: TPE Mask                       */
#define DRY_TER_TPE_SHIFT                        (16U)                                               /*!< DRY_TER: TPE Position                   */
#define DRY_TER_TPE(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_TER_TPE_SHIFT))&DRY_TER_TPE_MASK) /*!< DRY_TER                                 */
/* ------- PDR Bit Fields                           ------ */
#define DRY_PDR_TPD_MASK                         (0xFFU)                                             /*!< DRY_PDR: TPD Mask                       */
#define DRY_PDR_TPD_SHIFT                        (0U)                                                /*!< DRY_PDR: TPD Position                   */
#define DRY_PDR_TPD(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_PDR_TPD_SHIFT))&DRY_PDR_TPD_MASK) /*!< DRY_PDR                                 */
#define DRY_PDR_TPOD_MASK                        (0xFF0000U)                                         /*!< DRY_PDR: TPOD Mask                      */
#define DRY_PDR_TPOD_SHIFT                       (16U)                                               /*!< DRY_PDR: TPOD Position                  */
#define DRY_PDR_TPOD(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PDR_TPOD_SHIFT))&DRY_PDR_TPOD_MASK) /*!< DRY_PDR                                 */
/* ------- PPR Bit Fields                           ------ */
#define DRY_PPR_TPP_MASK                         (0xFFU)                                             /*!< DRY_PPR: TPP Mask                       */
#define DRY_PPR_TPP_SHIFT                        (0U)                                                /*!< DRY_PPR: TPP Position                   */
#define DRY_PPR_TPP(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_PPR_TPP_SHIFT))&DRY_PPR_TPP_MASK) /*!< DRY_PPR                                 */
#define DRY_PPR_TPID_MASK                        (0xFF0000U)                                         /*!< DRY_PPR: TPID Mask                      */
#define DRY_PPR_TPID_SHIFT                       (16U)                                               /*!< DRY_PPR: TPID Position                  */
#define DRY_PPR_TPID(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PPR_TPID_SHIFT))&DRY_PPR_TPID_MASK) /*!< DRY_PPR                                 */
/* ------- ATR Bit Fields                           ------ */
#define DRY_ATR_ATSR_MASK                        (0xFFFFU)                                           /*!< DRY_ATR: ATSR Mask                      */
#define DRY_ATR_ATSR_SHIFT                       (0U)                                                /*!< DRY_ATR: ATSR Position                  */
#define DRY_ATR_ATSR(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_ATR_ATSR_SHIFT))&DRY_ATR_ATSR_MASK) /*!< DRY_ATR                                 */
#define DRY_ATR_ATP_MASK                         (0xFFFF0000U)                                       /*!< DRY_ATR: ATP Mask                       */
#define DRY_ATR_ATP_SHIFT                        (16U)                                               /*!< DRY_ATR: ATP Position                   */
#define DRY_ATR_ATP(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_ATR_ATP_SHIFT))&DRY_ATR_ATP_MASK) /*!< DRY_ATR                                 */
/* ------- PGFR Bit Fields                          ------ */
#define DRY_PGFR_GFW_MASK                        (0x3FU)                                             /*!< DRY_PGFR: GFW Mask                      */
#define DRY_PGFR_GFW_SHIFT                       (0U)                                                /*!< DRY_PGFR: GFW Position                  */
#define DRY_PGFR_GFW(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PGFR_GFW_SHIFT))&DRY_PGFR_GFW_MASK) /*!< DRY_PGFR                                */
#define DRY_PGFR_GFP_MASK                        (0x40U)                                             /*!< DRY_PGFR: GFP Mask                      */
#define DRY_PGFR_GFP_SHIFT                       (6U)                                                /*!< DRY_PGFR: GFP Position                  */
#define DRY_PGFR_GFP(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PGFR_GFP_SHIFT))&DRY_PGFR_GFP_MASK) /*!< DRY_PGFR                                */
#define DRY_PGFR_GFE_MASK                        (0x80U)                                             /*!< DRY_PGFR: GFE Mask                      */
#define DRY_PGFR_GFE_SHIFT                       (7U)                                                /*!< DRY_PGFR: GFE Position                  */
#define DRY_PGFR_GFE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PGFR_GFE_SHIFT))&DRY_PGFR_GFE_MASK) /*!< DRY_PGFR                                */
#define DRY_PGFR_TPEX_MASK                       (0x30000U)                                          /*!< DRY_PGFR: TPEX Mask                     */
#define DRY_PGFR_TPEX_SHIFT                      (16U)                                               /*!< DRY_PGFR: TPEX Position                 */
#define DRY_PGFR_TPEX(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_PGFR_TPEX_SHIFT))&DRY_PGFR_TPEX_MASK) /*!< DRY_PGFR                                */
#define DRY_PGFR_TPE_MASK                        (0x1000000U)                                        /*!< DRY_PGFR: TPE Mask                      */
#define DRY_PGFR_TPE_SHIFT                       (24U)                                               /*!< DRY_PGFR: TPE Position                  */
#define DRY_PGFR_TPE(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_PGFR_TPE_SHIFT))&DRY_PGFR_TPE_MASK) /*!< DRY_PGFR                                */
/* ------- WAC Bit Fields                           ------ */
#define DRY_WAC_SKVW_MASK                        (0x2U)                                              /*!< DRY_WAC: SKVW Mask                      */
#define DRY_WAC_SKVW_SHIFT                       (1U)                                                /*!< DRY_WAC: SKVW Position                  */
#define DRY_WAC_SKVW(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_WAC_SKVW_SHIFT))&DRY_WAC_SKVW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_SKWRW_MASK                       (0x4U)                                              /*!< DRY_WAC: SKWRW Mask                     */
#define DRY_WAC_SKWRW_SHIFT                      (2U)                                                /*!< DRY_WAC: SKWRW Position                 */
#define DRY_WAC_SKWRW(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_WAC_SKWRW_SHIFT))&DRY_WAC_SKWRW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_SKRRW_MASK                       (0x8U)                                              /*!< DRY_WAC: SKRRW Mask                     */
#define DRY_WAC_SKRRW_SHIFT                      (3U)                                                /*!< DRY_WAC: SKRRW Position                 */
#define DRY_WAC_SKRRW(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_WAC_SKRRW_SHIFT))&DRY_WAC_SKRRW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_CRW_MASK                         (0x10U)                                             /*!< DRY_WAC: CRW Mask                       */
#define DRY_WAC_CRW_SHIFT                        (4U)                                                /*!< DRY_WAC: CRW Position                   */
#define DRY_WAC_CRW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_CRW_SHIFT))&DRY_WAC_CRW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_SRW_MASK                         (0x20U)                                             /*!< DRY_WAC: SRW Mask                       */
#define DRY_WAC_SRW_SHIFT                        (5U)                                                /*!< DRY_WAC: SRW Position                   */
#define DRY_WAC_SRW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_SRW_SHIFT))&DRY_WAC_SRW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_LRW_MASK                         (0x40U)                                             /*!< DRY_WAC: LRW Mask                       */
#define DRY_WAC_LRW_SHIFT                        (6U)                                                /*!< DRY_WAC: LRW Position                   */
#define DRY_WAC_LRW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_LRW_SHIFT))&DRY_WAC_LRW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_IEW_MASK                         (0x80U)                                             /*!< DRY_WAC: IEW Mask                       */
#define DRY_WAC_IEW_SHIFT                        (7U)                                                /*!< DRY_WAC: IEW Position                   */
#define DRY_WAC_IEW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_IEW_SHIFT))&DRY_WAC_IEW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_TSRW_MASK                        (0x100U)                                            /*!< DRY_WAC: TSRW Mask                      */
#define DRY_WAC_TSRW_SHIFT                       (8U)                                                /*!< DRY_WAC: TSRW Position                  */
#define DRY_WAC_TSRW(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_WAC_TSRW_SHIFT))&DRY_WAC_TSRW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_TEW_MASK                         (0x200U)                                            /*!< DRY_WAC: TEW Mask                       */
#define DRY_WAC_TEW_SHIFT                        (9U)                                                /*!< DRY_WAC: TEW Position                   */
#define DRY_WAC_TEW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_TEW_SHIFT))&DRY_WAC_TEW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_PDW_MASK                         (0x400U)                                            /*!< DRY_WAC: PDW Mask                       */
#define DRY_WAC_PDW_SHIFT                        (10U)                                               /*!< DRY_WAC: PDW Position                   */
#define DRY_WAC_PDW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_PDW_SHIFT))&DRY_WAC_PDW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_PPW_MASK                         (0x800U)                                            /*!< DRY_WAC: PPW Mask                       */
#define DRY_WAC_PPW_SHIFT                        (11U)                                               /*!< DRY_WAC: PPW Position                   */
#define DRY_WAC_PPW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_PPW_SHIFT))&DRY_WAC_PPW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_ATW_MASK                         (0x3000U)                                           /*!< DRY_WAC: ATW Mask                       */
#define DRY_WAC_ATW_SHIFT                        (12U)                                               /*!< DRY_WAC: ATW Position                   */
#define DRY_WAC_ATW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_ATW_SHIFT))&DRY_WAC_ATW_MASK) /*!< DRY_WAC                                 */
#define DRY_WAC_GFW_MASK                         (0xFF0000U)                                         /*!< DRY_WAC: GFW Mask                       */
#define DRY_WAC_GFW_SHIFT                        (16U)                                               /*!< DRY_WAC: GFW Position                   */
#define DRY_WAC_GFW(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_WAC_GFW_SHIFT))&DRY_WAC_GFW_MASK) /*!< DRY_WAC                                 */
/* ------- RAC Bit Fields                           ------ */
#define DRY_RAC_SKVR_MASK                        (0x2U)                                              /*!< DRY_RAC: SKVR Mask                      */
#define DRY_RAC_SKVR_SHIFT                       (1U)                                                /*!< DRY_RAC: SKVR Position                  */
#define DRY_RAC_SKVR(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_RAC_SKVR_SHIFT))&DRY_RAC_SKVR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_SKWRR_MASK                       (0x4U)                                              /*!< DRY_RAC: SKWRR Mask                     */
#define DRY_RAC_SKWRR_SHIFT                      (2U)                                                /*!< DRY_RAC: SKWRR Position                 */
#define DRY_RAC_SKWRR(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_RAC_SKWRR_SHIFT))&DRY_RAC_SKWRR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_SKRRR_MASK                       (0x8U)                                              /*!< DRY_RAC: SKRRR Mask                     */
#define DRY_RAC_SKRRR_SHIFT                      (3U)                                                /*!< DRY_RAC: SKRRR Position                 */
#define DRY_RAC_SKRRR(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_RAC_SKRRR_SHIFT))&DRY_RAC_SKRRR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_CRR_MASK                         (0x10U)                                             /*!< DRY_RAC: CRR Mask                       */
#define DRY_RAC_CRR_SHIFT                        (4U)                                                /*!< DRY_RAC: CRR Position                   */
#define DRY_RAC_CRR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_CRR_SHIFT))&DRY_RAC_CRR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_SRR_MASK                         (0x20U)                                             /*!< DRY_RAC: SRR Mask                       */
#define DRY_RAC_SRR_SHIFT                        (5U)                                                /*!< DRY_RAC: SRR Position                   */
#define DRY_RAC_SRR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_SRR_SHIFT))&DRY_RAC_SRR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_LRR_MASK                         (0x40U)                                             /*!< DRY_RAC: LRR Mask                       */
#define DRY_RAC_LRR_SHIFT                        (6U)                                                /*!< DRY_RAC: LRR Position                   */
#define DRY_RAC_LRR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_LRR_SHIFT))&DRY_RAC_LRR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_IER_MASK                         (0x80U)                                             /*!< DRY_RAC: IER Mask                       */
#define DRY_RAC_IER_SHIFT                        (7U)                                                /*!< DRY_RAC: IER Position                   */
#define DRY_RAC_IER(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_IER_SHIFT))&DRY_RAC_IER_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_TSRR_MASK                        (0x100U)                                            /*!< DRY_RAC: TSRR Mask                      */
#define DRY_RAC_TSRR_SHIFT                       (8U)                                                /*!< DRY_RAC: TSRR Position                  */
#define DRY_RAC_TSRR(x)                          (((uint32_t)(((uint32_t)(x))<<DRY_RAC_TSRR_SHIFT))&DRY_RAC_TSRR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_TER_MASK                         (0x200U)                                            /*!< DRY_RAC: TER Mask                       */
#define DRY_RAC_TER_SHIFT                        (9U)                                                /*!< DRY_RAC: TER Position                   */
#define DRY_RAC_TER(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_TER_SHIFT))&DRY_RAC_TER_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_PDR_MASK                         (0x400U)                                            /*!< DRY_RAC: PDR Mask                       */
#define DRY_RAC_PDR_SHIFT                        (10U)                                               /*!< DRY_RAC: PDR Position                   */
#define DRY_RAC_PDR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_PDR_SHIFT))&DRY_RAC_PDR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_PPR_MASK                         (0x800U)                                            /*!< DRY_RAC: PPR Mask                       */
#define DRY_RAC_PPR_SHIFT                        (11U)                                               /*!< DRY_RAC: PPR Position                   */
#define DRY_RAC_PPR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_PPR_SHIFT))&DRY_RAC_PPR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_ATR_MASK                         (0x3000U)                                           /*!< DRY_RAC: ATR Mask                       */
#define DRY_RAC_ATR_SHIFT                        (12U)                                               /*!< DRY_RAC: ATR Position                   */
#define DRY_RAC_ATR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_ATR_SHIFT))&DRY_RAC_ATR_MASK) /*!< DRY_RAC                                 */
#define DRY_RAC_GFR_MASK                         (0xFF0000U)                                         /*!< DRY_RAC: GFR Mask                       */
#define DRY_RAC_GFR_SHIFT                        (16U)                                               /*!< DRY_RAC: GFR Position                   */
#define DRY_RAC_GFR(x)                           (((uint32_t)(((uint32_t)(x))<<DRY_RAC_GFR_SHIFT))&DRY_RAC_GFR_MASK) /*!< DRY_RAC                                 */
/* ------- SKR Bit Fields                           ------ */
#define DRY_SKR_SK_MASK                          (0xFFFFFFFFU)                                       /*!< DRY_SKR: SK Mask                        */
#define DRY_SKR_SK_SHIFT                         (0U)                                                /*!< DRY_SKR: SK Position                    */
#define DRY_SKR_SK(x)                            (((uint32_t)(((uint32_t)(x))<<DRY_SKR_SK_SHIFT))&DRY_SKR_SK_MASK) /*!< DRY_SKR                                 */
/* ------- SWAC Bit Fields                          ------ */
#define DRY_SWAC_SKRW_MASK                       (0xFFU)                                             /*!< DRY_SWAC: SKRW Mask                     */
#define DRY_SWAC_SKRW_SHIFT                      (0U)                                                /*!< DRY_SWAC: SKRW Position                 */
#define DRY_SWAC_SKRW(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_SWAC_SKRW_SHIFT))&DRY_SWAC_SKRW_MASK) /*!< DRY_SWAC                                */
/* ------- SRAC Bit Fields                          ------ */
#define DRY_SRAC_SKRR_MASK                       (0xFFU)                                             /*!< DRY_SRAC: SKRR Mask                     */
#define DRY_SRAC_SKRR_SHIFT                      (0U)                                                /*!< DRY_SRAC: SKRR Position                 */
#define DRY_SRAC_SKRR(x)                         (((uint32_t)(((uint32_t)(x))<<DRY_SRAC_SKRR_SHIFT))&DRY_SRAC_SKRR_MASK) /*!< DRY_SRAC                                */
/**
 * @} */ /* End group DRY_Register_Masks_GROUP 
 */

/* DRY - Peripheral instance base addresses */
#define DRY_BasePtr                    0x40042000UL //!< Peripheral base address
#define DRY                            ((DRY_Type *) DRY_BasePtr) //!< Freescale base pointer
#define DRY_BASE_PTR                   (DRY) //!< Freescale style base pointer
/**
 * @} */ /* End group DRY_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup EWM_Peripheral_access_layer_GROUP EWM Peripheral Access Layer
* @brief C Struct for EWM
* @{
*/

/* ================================================================================ */
/* ================           EWM (file:EWM_2)                     ================ */
/* ================================================================================ */

/**
 * @brief External Watchdog Monitor
 */
/**
* @addtogroup EWM_structs_GROUP EWM struct
* @brief Struct for EWM
* @{
*/
typedef struct {                                /*       EWM Structure                                                */
   __IO uint8_t   CTRL;                         /**< 0000: Control Register                                             */
   __O  uint8_t   SERV;                         /**< 0001: Service Register                                             */
   __IO uint8_t   CMPL;                         /**< 0002: Compare Low Register                                         */
   __IO uint8_t   CMPH;                         /**< 0003: Compare High Register                                        */
} EWM_Type;

/**
 * @} */ /* End group EWM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'EWM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

